# -*- coding: utf-8 -*-
"""
Python3.5.1脚本，用于将输入的字母串变换成由‘#’号组成的字符画。
提供了两个将字符串输出为字符画的函数，一个通过全局变量控制每行的长度，另一个在每次使用时设置行长度，方便不同需要。
暂时只做出了几个字母的字模，但是原理上添加新的字模是没有困难的。
"""



letter_code={                             #字模字典
             'A':[['  ##    '],
                  [' #  #   '],
                  ['#    #  '],
                  ['######  '],
                  ['#    #  '],
                  ['#    #  ']],
             'B':[['####    '],
                  ['#   #   '],
                  ['####    '],
                  ['#   #   '],
                  ['#    #  '],
                  ['#####   ']],
             'C':[['  ####  '],
                  [' #      '],
                  ['#       '],
                  ['#       '],
                  [' #      '],
                  ['  ####  ']],
             'E':[['######  '],
                  ['#       '],
                  ['#####   '],
                  ['#       '],
                  ['#       '],
                  ['######  ']],
             'H':[['#    #  '],
                  ['#    #  '],
                  ['######  '],
                  ['#    #  '],
                  ['#    #  '],
                  ['#    #  ']],
             'I':[[' ###    '],
                  ['  #     '],
                  ['  #     '],
                  ['  #     '],
                  ['  #     '],
                  [' ###    ']],
             'L':[['#       '],
                  ['#       '],
                  ['#       '],
                  ['#       '],
                  ['#       '],
                  ['######  ']],
             'N':[['#    #  '],
                  ['##   #  '],
                  ['# #  #  '],
                  ['#  # #  '],
                  ['#   ##  '],
                  ['#    #  ']],
             'Y':[['#    #  '],
                  ['#   #   '],
                  [' # #    '],
                  ['  #     '],
                  ['  #     '],
                  ['  #     ']]
            } 
  
  

def amplifier(st):  #字符串字符画变换函数
    m=st
    i=0
    t=[]
    b=[]
    print('\n')
    while(i<6): 
        t[:]=[]
        n=len(m)
        while(n>0):
            t=t+letter_code[m[(len(m)-n)]][i]
            n=n-1
        i=i+1
        n=len(m)-1
        b[:]=t[:]
        while(n>0):
            b[(len(m)-n)]=b[(len(m)-n-1)]+t[(len(m)-n)]
            n=n-1
        print(b[(len(m)-1)])
        

def amp_s(nst,s):   #每行字母个数为s（临时变量）的分行输出函数
    l=len(nst)
    m=l//s
    n=l%s
    i=0
    while(i<m):
        amplifier(nst[(i*s):((i+1)*s)])
        i=i+1
    if(n>0):
        amplifier(nst[(i*s):])
        
 
def amp(nst):  #每行字母个数为sl（全局变量）的分行输出函数
    l=len(nst)
    m=l//sl
    n=l%sl
    i=0
    while(i<m):
        amplifier(nst[(i*sl):((i+1)*sl)])
        i=i+1
    if(n>0):
        amplifier(nst[(i*sl):]) 

 
sl=8  #用于控制amp函数的行宽度的全局变量



amp('LYNNCHEN')    
amp_s('CHENLIN',4)





